casos/tuboConv_grande/0/grad(T)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      grad(T);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   nonuniform List<vector> 
60000
(
(1.85357e-12 3.70715e-12 0)
(0 0 0)
(7.35889e-13 0 0)
(1.38688e-12 0 0)
(6.73756e-13 -5.39005e-12 -2.69502e-12)
(-5.05317e-13 0 0)
(-1.38688e-12 0 0)
(-7.35889e-13 -2.94356e-12 0)
...
)
;

boundaryField
{
    walls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
8000
(
(-68501.2 58505.5 0)
(-69330.9 42486 0)
(-69770.5 28899.9 2.9584e-12)
(-69991.5 16803.5 0)
(-70082.9 5515.64 8.97445e-14)
(-70082.9 -5515.64 8.97445e-14)
(-69991.5 -16803.5 0)
(-69770.5 -28899.9 -2.9584e-12)
...
)
;
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
300
(
(1.85357e-12 3.70715e-12 0)
(3.2341e-12 1.61705e-12 0)
(-2.94356e-12 7.35889e-13 0)
(-2.77377e-12 1.38688e-12 0)
(0 1.68439e-13 0)
(-2.69502e-12 -1.68439e-13 0)
(0 -1.38688e-12 0)
(-2.94356e-12 -3.67944e-12 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
300
(
(3.70715e-12 3.70715e-12 0)
(6.4682e-12 -1.61705e-12 0)
(0 0 0)
(5.54753e-12 -3.46721e-13 0)
(-5.39005e-12 -5.05317e-13 0)
(0 5.05317e-13 0)
(0 3.46721e-13 0)
(0 0 0)
...
)
;
    }
}


// ************************************************************************* //
